src/cf/InformationRegisters/ТелеграмЖурнал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ТелеграмЖурнал</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтрокаJSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Метод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмБоты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/HTTPServices/ТелеграмВебхук/Ext/Module.bsl
Функция ЛюбойPost(Запрос)
	
	ВебхукКлюч = Запрос.ПараметрыURL["Ключ"];
	ДанныеБота = ТелеграмСервер.ПолучитьДанныеБотаПоКлючу(ВебхукКлюч);
	Если ДанныеБота = Неопределено Тогда
		Ответ = Новый HTTPСервисОтвет(404);
		Возврат Ответ;
	КонецЕсли;
	
	СтрокаJSON = Запрос.ПолучитьТелоКакСтроку();
	
	РегистрыСведений.ТелеграмЖурнал.ДобавитьЗапись(ДанныеБота.Бот, СтрокаJSON, "Webhook", "ВХ");
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	
	Обновление = ФабрикаXDTO.ПрочитатьJSON(ЧтениеJSON);
	ТелеграмСервер.ОбработатьВходящееОбновлениеБота(Обновление, ДанныеБота);
	
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
	
КонецФункции


Функция ЛюбойGet(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Тело = "<HTML><HEAD><meta charset=""utf-8""></HEAD><BODY>Привет, я GET-метод бота Telegram. Ключ: " + Запрос.ПараметрыURL["Ключ"] + "</BODY></HTML>";
	Ответ.УстановитьТелоИзСтроки(Тело, КодировкаТекста.UTF8);
	Возврат Ответ;
	
КонецФункции
